{
  "296980": {
    "title": "2025 NFL roster cuts tracker: Updates for all 32 teams",
    "publication_date": "Aug 26, 2025",
    "author": "NFL NationAug 26, 2025, 09:04 PM ET",
    "main_content": "The 2025 NFL season will kick off next week, as the defending Super Bowl champion Philadelphia Eagles host the Dallas Cowboys on Sept. 4 (8:20 p.m. ET, NBC). In preparation, teams were required to finalize their 53-man rosters by 4 p.m. ET Tuesday.\nThere were several notable cuts, including the Panthers parting ways with wide receiver Hunter Renfrow. And multiple trades took place this week, including the Raiders acquiring quarterback Kenny Pickett from the Browns.\nAs every team makes cuts official, our NFL Nation reporters will provide live updates on which players didn't make the roster.\nNFC East\nDallas Cowboys\nBiggest move : With the uncertain status of Micah Parsons for the opener, James Houston (one sack, three hurries and two tackles for loss in 2024) was likely one of the beneficiaries, as Dallas chose to carry six pass rushers on the 53-man roster. Houston has been disruptive in practices and during the games, but can he make it to Week 1 still on the active roster and see playing time? The Cowboys likely will bring back Hakeem Adeniji as their swing tackle and cornerback C.J. Goodwin to the roster as soon as Wednesday, when they can place running back Phil Mafah (shoulder) and cornerback Caelen Carson (knee) on injured reserve/designated to return. -- Todd Archer\nTraded : OL Asim Richards (New Orleans)\nWaived/released : OT Hakeem Adeniji, DL Tommy Akingbesote, LB Justin Barron, OL Nick Broeker, WR Jalen Brooks, DL Earnest Brown IV, OL Saahdiq Charles, OL Geron Christian, S Alijah Clark, OL La'el Collins, WR Jalen Cropper, RB Malik Davis, DT Denzel Daxon, TE Princeton Fant, TE Rivaldo Fairweather, CB C.J. Goodwin, QB Will Grier, CB Kemon Hall, LB Darius Harris, WR Traeshon Holden, LB Buddy Johnson, WR Josh Kelly, CB Christian Matthew, DB Israel Mukuamu, TE Tyler Neville, CB Michael Ojemudia, CB Troy Pride Jr, CB Robert Rochell, S Mike Smith Jr, TE John Stephens Jr, RB Deuce Vaughn, DE Tyrus Wheat.\nNew York Giants\nBiggest move : The Giants cut Tommy DeVito. It was expected and really became a lock when they signed Russell Wilson and Jameis Winston and also drafted Jaxson Dart. DeVito was the fourth quarterback all spring and summer, and the Giants weren't going to keep four quarterbacks on the active roster. Maybe DeVito lands on the practice squad, but even that seems like a long shot. However, Ihmir Smith-Marsette not getting an opportunity as the returner was significantly more surprising than the DeVito move. Smith-Marsette returned a kickoff for a touchdown -- and a punt, as well, even though it was called back because of a penalty -- while averaging almost 35 yards per kickoff return in 2024. One would’ve thought that earned him another chance to be the returner. But the Giants instead chose Gunner Olszewski over Smith-Marsette to be their returner to start the season. -- Jordan Raanan\nWaived/released : QB Tommy DeVito, RB Dante Miller, RB Jonathan Ward, TE Greg Dulcich, TE Jermaine Terry II, CB Tre Hawkins III, CB Dee Williams, DL Elijah Chatman, DL Jeremiah Ledbetter, DL Jordon Riley, DL Cory Durden, DL Elijah Garcia, G Jake Kubas, OL Bryan Hudson, OT Stone Forsythe, K Jude McAtamney, OLB Trace Ford, OLB Tomon Fox, S Raheem Layne, S Makari Paige, WR Ihmir Smith-Marsette, WR Juice Wells Jr., WR Lil'Jordan Humphrey, WR Dalen Cambre, WR Da'Quan Felton.\nPhiladelphia Eagles\nBiggest move: The additions of tackle Fred Johnson and quarterback Sam Howell bolster depth at a couple of key areas. No. 2 QB Tanner McKee has earned the trust of the organization, but he suffered a finger injury on his throwing hand late in training camp. Rookie Kyle McCord isn't ready for NFL action quite yet, so the Eagles turned to Howell, who has 18 career starts under his belt. Johnson spent the past two seasons in Philadelphia before signing with the Jaguars earlier this offseason. With no one emerging at camp this summer, he can step right into the swing tackle role on game day. -- Tim McManus\nTraded : OL Darian Kinnard\nAcquired : OT Fred Johnson, QB Sam Howell\nWaived/released: LS Charley Hughlett, OLB Patrick Johnson, T Kendall Lamm, WR Terrace Marshall Jr., CB Parry Nickerson, WR Avery Williams, WR Ife Adeyi, LB Chance Campbell, CB Tariq Castro-Fields (injured), WR Elijah Cooks, LB Lance Dixon, DT Joe Evans, LB Dallas Gant, G Kenyon Green, S Maxen Hook, TE E.J. Jenkins, CB Brandon Johnson, RB Montrell Johnson Jr., TE Cameron Latu, OLB Ochaun Mathis, QB Kyle McCord, WR Taylor Morin, TE Nick Muse, T Hollin Pierce, RB ShunDerrick Powell, OLB Antwaun Powell-Ryland Jr., CB Eli Ricks, DE Jereme Robinson, RB Keilan Robinson, DT Justin Rogers, S Andre' Sam, WR Ainias Smith, DT Jacob Sykes, T Laekin Vakalahi, CB A.J. Woods.\nWashington Commanders\nBiggest move: Washington's biggest roster move occurred last week when it traded running back Brian Robinson Jr. to San Francisco. But the Commanders' most significant move Tuesday was keeping right guard Sam Cosmi on the physically unable to perform list. That means he'll be sidelined for at least the first four weeks of the season as he continues rehabbing from a torn right ACL suffered in the NFC divisional round in January. Nick Allegretti has been working in his place. The Commanders have been optimistic about Cosmi's recovery, but it's an injury that often has a healing timeline of nine to 12 months. -- John Keim\nWaived/released : WR K.J. Osborn, WR Michael Gallup, WR Chris Moore, WR Braylon Sanders, DE Clelin Ferrell, DE Jalyn Holmes, C Nick Harris, DT Norell Pollard, LB Duke Riley, CB Bobby Price, OL Tyre Phillips, OL Foster Sarell, CB Essang Bassey, QB Sam Hartman, DT Carl Davis Jr., CB Car'lin Vigers, DE Andre Jones Jr., RB Demetric Felton, WR Tay Martin, S Robert McDaniel, TE Cole Turner, RB Kaz Allen, LB Kam Arnold, DT Ricky Barber, TE Lawrence Cager, WR River Cracraft, DT Sheldon Day, C Michael Deiter, CB Antonio Hamilton Sr., OT Bobby Hart, DE T.J. Maguranyanga, OT Timothy McKay, S Ben Nikkel, S Daryl Worley, WR Jacoby Jones, WR Ja'Corey Brooks.\nReserve/PUP : RG Sam Cosmi.\nNFC North\nChicago Bears\nBiggest move : Undrafted free agent wide receiver Jahdae Walker made the Bears' initial 53-man roster after a strong preseason when he tied for the team lead with two touchdowns, including a walk-off score at Kansas City. His play on special teams earned him the sixth wide receiver spot. Elsewhere on offense, former third-round pick Kiran Amegadjie was among the 10 offensive linemen the Bears kept on the 53 despite his struggles to climb the depth chart. While Amegadjie spent most of his time as the third-string left tackle after returning from a leg injury, general manager Ryan Poles said the Bears have begun experimenting with him at guard. -- Courtney Cronin\nWaived/released : WR Maurice Alexander, LB Swayze Bozeman, WR Miles Boykin, DB Millard Bradford, RB Brittain Brown, TE Stephen Carlson, DL Xavier Carlton, CB Alex Cook, LB Power Echols, LS Luke Elkin, CB Tre Flowers, DL Jonathan Ford, RB Royce Freeman, DB Mekhi Garner, OL Chris Glaser, TE Thomas Gordon, DB Kaleb Hayes, DE Tanoh Kpassagnon, DL Jamree Kromah, OL Jordan McFadden, OL Joshua Miles, DB Mark Perry, DL Zacch Pickens, WR JP Richardson, QB Austin Reed, WR Tyler Scott, OL Ricky Stromberg, WR Samori Toure, DB Jeremiah Walker, RB Ian Wheeler, TE Joel Wilson.\nDetroit Lions\nBiggest move : Coach Dan Campbell certainly feels good about his roster entering the season, calling it his best from top to bottom since he arrived in 2021. But there were a few surprising transactions. After selecting defensive end Ahmed Hassanein in the sixth round for help on the edge, the first Egyptian to be drafted into the NFL was waived with an injury settlement after suffering a pectoral injury. Detroit also released fan favorite Dan Skipper, who was expected to contribute on the offensive line. The Lions still have three roster spots remaining, which means they could be up to something big. -- Eric Woodyard\nWaived/released : EDGE Ahmed Hassanein, DL Myles Adams, OL Trystan Colon, WR Tom Kennedy, OL Netane Muti, LB Anthony Pittman, OL Dan Skipper, WR Malik Taylor, EDGE Mitchell Agude, CB Luq Barcoo, WR Ronnie Bell, OL Gunner Britton, DL Keith Cooper Jr, CB Allan George, LB DaRon Gilbert, S Erick Hallett, QB Hendon Hooker, TE Zach Horton, RB Deon Jackson, OL Zack Johnson, WR Jakobie Keeney-James, S Ian Kennelly, EDGE Nate Lynn, DL Brodric Martin, WR Jackson Meeks, CB DJ Miller, OL Mason Miller, OL Michael Niese, S Morice Norris, TE Gunnar Oakes, CB Tyson Russell, CB Nick Whiteside, RB Jacob Saylors, TE Steven Stilianos, S Loren Strickland, EDGE Isaac Ukwu, CB Zah Frazier.\nGreen Bay Packers\nBiggest move: Someone who had never played his position in the NFL until a few months ago made the team, while a former first-round draft pick and a three-time Super Bowl champ did not. That would be Bo Melton, a wideout-turned-cornerback, who made it, while linebacker Isaiah Simmons (No. 8 pick in 2020) and wide receiver/kick returner Mecole Hardman did not. Melton competed in 22 games as a wideout over the past two seasons, and he didn't move to cornerback until the June minicamp. If that was a surprise, then perhaps an undrafted rookie qualifying for the 53 shouldn't be: Defensive tackle Nazir Stackhouse made it 21 straight seasons for the Packers with at least one undrafted free agent on the Week 1 roster, assuming he remains on it for the opener.-- Rob Demovsky_\nWaived/released : RB Israel Abanikanda, DL Deslin Alexandre, DB Johnathan Baldwin, CB Corey Ballentine, T Brant Banks, LB Jared Bartlett, QB Sean Clifford, G Tyler Cooper, RB Tyrion Davis-Price, QB Taylor Elgersma, DL James Ester, WR Mecole Hardman, CB Tyron Herring, WR Julian Hicks, C Trey Hill, RB Amar Johnson, WR Cornelius Johnson, LB Jamon Johnson, CB Kalen King, G JJ Lippe, TE Johnny Lumpkin, K Mark McNamee, DL Arron Mosby, WR Isaiah Neyor, DL Devonte O'Malley, WR Will Sheppard, DL Justin Rogers, S Omar Brown, WR Ja'Sean Reed, WR Jaden Smith, TE Treyton Welch, RB Marcus Yarns.",
    "cleaned_date_timestamptz": "2025-08-26T00:00:00",
    "content_type": "news-round-up",
    "type_confidence": 0.95,
    "type_reasoning": "The excerpt is a tracker/roundup giving short, team-by-team updates about 53-man roster cuts across all 32 NFL teams rather than a single coherent story."
  },
  "296979": {
    "title": "Graziano: Don't be surprised if these 32 things happen, from an MVP run to rookies who could star",
    "publication_date": "Aug 27, 2025, 06:30 AM ET",
    "author": "Dan Graziano",
    "main_content": "We are back for our [annual edition of preseason surprise predictions -- one for each of the 32 NFL teams ahead of the 2025 season.]\n\nIt's an odd concept, of course, because if we could predict these things then they shouldn't really be surprises. But the idea is to collect some of the information I've been gathering around the league throughout training camp and present a potential surprise that may or may not have been on your radar as a fan. We hit potential stat leaders, under-the-radar teams, award candidates, sleeper players to watch and position groups that might look better (or worse) than expected.\n\nAs always, I recognize that some of these might be more surprising than others, and that those of you who follow a specific team closely might not be as surprised as those who don't follow said team that closely. But we're here for _all_ the people, and we hope you enjoy it. Let's begin in the NFC East.\n\n## [New York Giants\nDon't be surprised if ... the Giants lead the league in sacks.\nWhat I'm hearing: Word out of Giants camp is Abdul Carter is everything the team believed him to be when it made him the third pick in this year's draft. Adding Carter to a defensive front that already features Brian Burns, Dexter Lawrence II and Kayvon Thibodeaux should give the Giants one of the more fearsome and tireless pass rushes in the entire NFL. There are a ton of questions on the offensive side of the ball, even beyond the one about when Russell Wilson will have to pass the starting QB job over to rookie Jaxson Dart. But the defense up front should be the team's strength, and it could be enough to propel the Giants to a few surprise wins against their tough-looking schedule -- especially if they can generate turnovers and give the offense some short fields. New York tied for eighth in sacks last season with 45.\n\n## [Philadelphia Eagles\nDon't be surprised if ... they keep tinkering with the defense.\nWhat I'm hearing: The reigning Super Bowl champs lost five key contributors from last season's defense and are working to replace them with younger players they've drafted in recent years, anticipating the roster turnover. They're excited about guys like Moro Ojomo and Jalyx Hunt. They're extremely fired up about rookie first-round pick Jihaad Campbell. And with two-thirds of their salary cap committed to the offense, they will need production from young players on the defensive side of the ball. But not every development timetable goes as planned, and asking younger players to take on larger roles brings some risk. This Eagles group has no interest in stopping at one Super Bowl title. They're thinking dynasty thoughts. We've already seen GM Howie Roseman make multiple trades this month, including one that brought in cornerback Jakorian Bennett from the Raiders to address a potentially thin area of the defense. Roseman won't sit on his hands if more questions rise.\n\n## [Washington Commanders\nDon't be surprised if ...Deebo Samuel gets some work at running back.\nWhat I'm hearing: I don't think it'll be exactly like it was in San Francisco in 2021, when Samuel was getting six, seven carries per game and occasionally even serving as the team's primary running back. But Washington's coaches believe Samuel can be a factor when lined up in the backfield, and they'll be looking for ways to get him touches. Remember that Wes Welker, who is on the Commanders' staff as a personnel analyst, was the 49ers' wide receivers coach for the first three years of Samuel's career and has a strong relationship with him -- and a pretty good idea of how to get the best out of him. Over six seasons, Samuel has 202 rushes for 1,143 yards and 20 TDs.\n\n## NFC NORTH\n## [Chicago Bears\nDon't be surprised if ... rookie tight endColston Loveland is a huge part of the Bears' offense.\nWhat I'm hearing: The Bears selected Loveland 10th in this year's draft, so he's not any kind of sleeper. But he took a while to get up to speed this offseason because he was recovering from an injury, and for that reason, some might have wondered if it'd take some time for him to work his way into the offense. I don't think it will. Loveland is the guy whose name comes up every time I ask somebody about Bears camp. He's quarterback-friendly. He's big and fast. He's polished in his route running. He was healthy to start training camp, so he advanced quickly once August got going. And his connection with quarterback Caleb Williams is said to already be outstanding. The Bears have a lot of very good pass catchers, with DJ Moore, Rome Odunze, Cole Kmet and Luther Burden III. But as Williams continues his development under new coach Ben Johnson, he could lean on Loveland a lot -- especially early.\n\n## [Detroit Lions\nDon't be surprised if ...Jahmyr Gibbs is the top-scoring fantasy running back.\nWhat I'm hearing: Yeah, not exactly the boldest prediction, considering Gibbs was second in fantasy points per game last season and actually scored the most points total because Saquon Barkley sat out Week 18. But a lot of people credit that to a furious finish, which coincided with David Montgomery's absence from the lineup. Yes, Montgomery is back healthy, which portends a return to the two-headed running back operation that Detroit favors. But the Lions believe Gibbs has another gear to reach. They think an improved Jameson Williams will open up the field for shorter passes to the backs. And if they have a weakness, it's on the interior of their offensive line, where center Frank Ragnow retired. That could make the Lions less likely to rely on Montgomery between the tackles and more likely to get creative with Gibbs in space.\n\n## Green Bay Packers\nDon't be surprised if ... quarterbackJordan Love is an MVP finalist.\nWhat I'm hearing: It sounds like Love will be fully healthy and ready to go for Week 1, even after having a procedure a couple of weeks ago to treat an injury to the thumb of his non-throwing hand. Remember that Love injured his knee in last season's opener against the Eagles in Brazil and took a while to get back to full health. Remember also that the Packers had the youngest roster in the league last season and still finished in the top five in defensive EPA and defensive efficiency in the first year of a new defensive system. They drafted Matthew Golden in the first round to add a potential true No. 1 WR to Love's already deep wide receiver corps. They also have depth at tight end, an impact running back in Josh Jacobs and a strong offensive line. And of their seven losses last season, six came to the Lions, Vikings and Eagles -- the top three teams in the NFC. If the Packers can improve their performance against the league's top contenders and Love can stay healthy, they are set up to win a lot of games this season. And if they do that, their quarterback is going to be a top MVP candidate.\n\n## [Minnesota Vikings\nDon't be surprised if ...Jordan Mason leads the team in rushing.\nWhat I'm hearing: The Vikings love Aaron Jones Sr. If you’ve ever talked to Jones, you know why. He is a great player and a great guy to have in your locker room. But he's also 30 years old and coming off a 322-touch season. The Vikings traded for Mason, the former 49ers back who they believe adds an explosive element to their run game. So far, they've been thrilled with Mason's play, and they envision a pretty even split in running back duties this season between him and Jones. But during some Christian McCaffrey absences in San Francisco, Mason did show the ability to function as more than just part of a tandem. He ran for 789 yards on 153 carries last season. So it's not hard to picture a scenario in which the Vikings decide to lean more on him as the season goes along. Again, nothing against Jones -- this could just be the natural evolution of things in Minnesota.\n\n## NFC SOUTH\n## [Atlanta Falcons\nDon't be surprised if ... tight endKyle Pitts Sr. ends up getting traded.\nWhat I'm hearing: Part of this is what I'm seeing -- or rather not seeing. Pitts is in the final year of his contract, playing for $10.878 million on the fifth-year option from his rookie deal. The Falcons have made no move to extend him beyond this season. The fourth pick of the 2021 draft has averaged 49 catches per season and caught a total of 10 touchdown passes in his four-year career while struggling to consistently stay healthy. When No. 2 receiver Darnell Mooney went down with an injury early in training camp, there was a lot of talk about Atlanta filling that void by playing two-tight end sets and basically using Pitts as a receiver. And the Falcons absolutely might still try that. But there are definitely signs that they don't view Pitts as a great fit for what they're trying to do on offense. Mooney's training camp absence gave some of the younger receivers on the roster a chance to show what they can do, and if one or more of them has emerged as a reliable contributor by the time the trade deadline rolls around, don't be shocked if Pitts is on the move.\n\n## [Carolina Panthers\nDon't be surprised if ... quarterbackBryce Young is in line for a contract extension next spring.\nWhat I'm hearing: The Panthers believe the improvement Young showed toward the end of last season will carry over into 2025 -- not just because of the way he performed on the field but also because of how comfortable he got in his role as starting quarterback. Coaches feel like Young has turned a corner in terms of his confidence and outward competitiveness. And now Carolina added wide receiver Tetairoa McMillan in the first round of this year's draft to a receiver room that already included last year's first-round pick Xavier Legette and veteran Adam Thielen. The Panthers might have a long way to go before being competitive (though maybe not, if their offseason improvements on defense have a lot of instant impact). But they think they have Young on the right track after a disappointing rookie year in 2023 and a rough start to 2024 that saw him benched for veteran Andy Dalton.\n\n## [New Orleans Saints\nDon't be surprised if ...Spencer Rattler gets a pretty long run as starting quarterback.\nWhat I'm hearing: The Saints announced Rattler as their starting QB on Tuesday. He beat out rookie Tyler Shough in a very close training camp competition. Shough was the 40th pick in the draft and turns 26 next month, so it's reasonable to think they want him to play soon. But Rattler has already surpassed expectations by beating out Shough, and if he performs in the regular season the way he did throughout camp, he could hold on to the job longer than many expect. Rattler had fans in the Saints' building last season who felt he had more room to grow. Shough will get his chance, and if the Saints start losing a lot of games, maybe they go to him just for the sake of change. But Rattler has the job for now, and I don't get the sense that it's a short leash.\n\n## [Tampa Bay Buccaneers\nDon't be surprised if ... rookie Emeka Egbuka is the Bucs' leading receiver.\nWhat I'm hearing: The team has been absolutely raving about first-round pick Egbuka throughout the summer, praising him as hyper-advanced for a rookie in all facets of his game. Chris Godwin, who is working his way back from a major season-ending ankle injury, is on a very uncertain timetable for returning to the field and an even more uncertain one for returning to his old self. Veteran Mike Evans' next sub-1,000-yard season will be his first, but he is 32 and missed three games last season. And Jalen McMillan last year's rookie standout who caught seven touchdown passes in the final five games of the season, will miss the start of 2025 because of a neck injury. If he's everything we're being told he is, Egbuka can play any of the wide receiver spots in the Tampa Bay offense, already has the trust of quarterback Baker Mayfield and appears in line for a massive share of the target opportunity on one of the league's best offenses.\n\n## NFC WEST\n## [Arizona Cardinals\nDon't be surprised if ... tight endTrey McBride is the Cardinals' leading receiver again.\nWhat I'm hearing: Sure, the Cards drafted wide receiver Marvin Harrison Jr. with the fourth pick in 2024. And yes, everything we've heard out of Arizona this offseason has indicated Harrison is improving on his connection with quarterback Kyler Murray and should be a bigger part of the offense than he was as a rookie. But that still doesn't mean he'll be the biggest part of it. Offensive coordinator Drew Petzing's system is built to feature McBride as its top target, and all indications are that the Cardinals see no reason for that to change. McBride is an exceptional player who has been a reliable performer for Murray every time they've been on the field together. And yes, fantasy football managers, I think you can expect his touchdown numbers to climb. McBride had 111 catches for 1,146 yards last season, but he scored just two TDs.\n\n## [Los Angeles Rams\nDon't be surprised if ... quarterback Jimmy Garoppolo has to start at some point.\nWhat I'm hearing: The Rams believe starting QB Matthew Stafford is on track to be healthy and start Week 1 after struggling throughout camp with a back injury that stubbornly refused to follow his or the team's recovery timetable. But Stafford is 37 years old and has dealt with back issues in the past. (To his credit, he has found ways to play through them.) My understanding is that this isn't something the Rams expect to sideline Stafford for a long period of time or affect his play early in the season, but that it is something that will need to be monitored and managed throughout the season. That means there could come a week when Stafford feels he can't play through it. And that's where you could see backup Garoppolo -- who started one game last season -- having to step in and keep things humming. Again, I expect Stafford to tough this out and make it through the season; this Rams team has him convinced he can win another Super Bowl before he's done. But it might not always be the smoothest process.\n\n## [San Francisco 49ers\nDon't be surprised if ... the 49ers end up back in the Super Bowl.\nWhat I'm hearing: Good things! I don't understand why so many people are sleeping on the 49ers, who were in the Super Bowl two seasons ago and saw their 2024 season completely disintegrate because of injuries. They lost some guys this offseason, sure, but they still have Christian McCaffrey, Trent Williams, George Kittle, Nick Bosa, Fred Warner ... I could go on, but you get the idea. A lot of talent. At this stage of their careers, McCaffrey and Williams in particular have to be considered injury risks, but if they stay healthy, there's no reason this can't be an elite offense for quarterback Brock Purdy. Ricky Pearsall, the team's 2024 first-round pick who was recovering from a gunshot wound at the start of last season, appears poised to take on a leading role while Jauan Jennings figures out his calf/contract situation and Brandon Aiyuk works his way back from a knee injury. This team has a good chance to bounce all the way back to being one of the best -- if not the best -- in the NFC, especially against a schedule that includes just four games against teams that made last season's playoffs.\n\n## [Seattle Seahawks\nDon't be surprised if ... their defense keeps them in the playoff race.\nWhat I'm hearing: The Seahawks ranked in the top 10 in defensive efficiency and defensive EPA last year in Mike Macdonald's first season as their coach, but they still finished in the middle of the pack in yards allowed and points allowed. In their second year in Macdonald's system, they should be dominant. His defense has worked everywhere he has been, including the Ravens and the University of Michigan. His ability to scheme up pressures is as good as anyone's. It takes time to learn a new scheme, but after playing in it for a year, Seattle's defensive players are primed for a massive season on that side of the ball.\n\n## AFC EAST\n## [Buffalo Bills\nDon't be surprised if ... the Bills make a trade or two to improve their defense.\nWhat I'm hearing: Buffalo feels great about its offense, which outscored every team in the NFL last year except the Lions. But it's still putting things together on the defensive side of the ball, where the Bills finished in the bottom half of the league last season with 5.5 yards allowed per play. The safety position has been a particularly thorny question mark, especially considering how important that position is in coach Sean McDermott's defense. McDermott and defensive coordinator Bobby Babich have done an excellent job in recent years of making in-season adjustments and bringing that group together. But don't be shocked if the front office looks to help them out here in the coming weeks or months with a strategic addition or two.\n\n## [Miami Dolphins\nDon't be surprised if ... the Dolphins are actually a wild-card contender.\nWhat I'm hearing: All of the vibes are bad, I get it. The Tua Tagovailoa-Tyreek Hill thing. A cornerback getting hurt seemingly every other day. The fact that the Mike McDaniel magic dust seemed to all blow away last season in Year 3. McDaniel is the most popular name on all of the preseason hot seat lists, and expectations for the Dolphins could not be lower. But I don't know. I hate just saying the same thing everyone else is saying, and a visit to their training camp last month got me thinking it might not be as terrible as folks are saying. The Dolphins started 2-6 last season but rebounded to win six of their next eight and ultimately end the season 8-9. We've seen teams fold up in those situations, and this one did not. McDaniel and the front office used that experience to identify the strong culture guys, move on from most of those who weren't and bring in outside veterans with strong leadership reputations. A ton rests on the Dolphins' ability to keep Tagovailoa healthy; literally everyone you talk to in that building mentions it. And the popular outside opinion is that they didn't invest enough in the offensive line this offseason. But McDaniel was 20-14 in his first two seasons in Miami and made the playoffs both times. There's a chance -- a chance -- he might be able to get the Dolphins back to where they were in 2022 and 2023. I know I'm out on a limb here, but sometimes you've got to go out on a limb.\n\n## [New England Patriots\nDon't be surprised if ... rookie TreVeyon Henderson is the team's No. 1 running back all season.\nWhat I'm hearing: If you've been prepping for fantasy drafts, you're already all over this. Henderson has been the most explosive element of the Patriots' offense throughout camp, and the coaching staff is smart enough to know New England needs some explosiveness. Henderson has been the most explosive element of the Patriots' offense throughout camp, and the coaching staff is smart enough to know New England needs some explosiveness. Henderson's concerns: whether he can hold up to a full-time starting RB's workload, considering he split carries with Quinshon Judkins last year at Ohio State. Rhamondre Stevenson is still there if the Patriots want to keep the rookie's workload lighter early in the season. But there's some sentiment in Foxborough that Henderson is going to be the type of player they don't want to take off the field.\n\n## [New York Jets\nDon't be surprised if ... the Jets lead the league in rushing.\nWhat I'm hearing: They're extremely high on second-year running back Braelon Allen, the 2024 fourth-round draft pick who's still only 21 years old. They also know what they have in Breece Hall, who can be a primary ball carrier, a receiving back or some combination of the two. And in Justin Fields, the Jets have one of the most electrifying runners at the quarterback position the league has ever seen. This team's offensive DNA is going to lie in its run game. And if Fields can show a consistent ability to get the ball downfield to Garrett Wilson in the passing game, it will only open things up more for the Jets to run, run, run.\n\n## AFC NORTH\n## [Baltimore Ravens\nDon't be surprised if ... wide receiverZay Flowers takes a third-year leap.\nWhat I'm hearing: The Ravens' offensive identity is still going to be in their outstanding run game, but Flowers is their No. 1 wide receiver, and his absence from last season's divisional round playoff game in Buffalo (kne e) played a part in their loss. He's healthy now and has had a nice camp. But the main reason I'm looking out for Flowers this season is the fact that DeAndre Hopkins has been on the team since the spring. Last year at the Super Bowl, Chiefs coaches were raving to me about the impact Hopkins had after Kansas City acquired him -- not as a pass catcher but as a teacher, particularly for rookie wideout Xavier Worthy. They talked about how Hopkins would grab the tablet after a drive, walk over to Worthy and teach him some of the finer details about route-running techniques. They felt Worthy's improved performance throughout the season was due in part to Hopkins' help, and Ravens coach John Harbaugh told me when I visited their camp that he has seen similar things from Hopkins since he has been in Baltimore. Perhaps Hopkins has the same kind of impact on Flowers that he had on Worthy.\n\n## [Cincinnati Bengals\nDon't be surprised if ... the Bengals return to the AFC Championship Game.\nWhat I'm hearing: The outside concern about the way the defense has looked in preseason games is not shared by those inside the building. The Bengals are installing a new scheme under new defensive coordinator Al Golden, and the coaching staff made a conscious decision to put as little of that scheme on tape as possible in the televised preseason games. Cincinnati's defense has only one direction to go after last season's collapse. Opponents scored 25.5 points per game on the Bengals, tied for seventh most in the league. If that unit can get back to even the middle of the pack, this is a dangerous team with a potent offense and players who know how to win playoff games. As poorly as the past two seasons have gone in Cincinnati, the Bengals still managed to finish 9-8 in both of them. If that's rock bottom, you have a contending roster.\n\n[Analysis and intro material from ESPN previews of the 2025 preseason predictions are included above. For a complete read, refer to the original ESPN article.]",
    "cleaned_date_timestamptz": "2025-08-27T06:30:00",
    "content_type": "topic_collection",
    "type_confidence": 0.93,
    "type_reasoning": "The excerpt describes an annual list of 32 preseason surprise predictions—one for each NFL team—containing multiple related snippets all on the same topic (predicted surprises across teams), not a single story or unrelated items."
  },
  "297014": {
    "title": "",
    "publication_date": "",
    "author": "2dJohn Keim",
    "main_content": "ASHBURN, Va. -- Washington Commanders wideout Terry McLaurin's first day back on the practice field looked a lot like those from the past. He was complimented on his routes, caught a couple of over-the-shoulder throws from quarterback Jayden Daniels and broke down the huddle with his receiving teammates before it began. \"It was like riding a bike,\" McLaurin said. One that could afford a lot more bells and whistles after he agreed Monday to a three-year contract extension. It ended McLaurin's hold-in and settled the final piece of business for Washington as it prepares for its Sept. 7 season opener versus the visiting New York Giants. \"I know I have a lot of elite ball ahead of me,\" McLaurin said. And unlike for much of the summer, McLaurin wore a jersey and a helmet rather than a hoodie pulled over his head, a welcome change for all involved. He participated in team drills during an hourlong practice. He had not been on the field with the team since the second phase of spring workouts after skipping the final two weeks as well as the mandatory minicamp. There were numerous twists and turns this summer for McLaurin. He expressed deep frustration with the process during a 30-minute interview with reporters on July 15. He held out for the first four days of camp, getting fined $50,000 per day. He then held in but was placed on the physically unable to perform list because, the team said, of a lingering ankle issue. He was removed from the PUP list on Aug. 16. In between, McLaurin requested to be traded, a move the team expected, according to multiple team sources. But McLaurin insisted it was real. \"That wasn't something that I was doing for just leverage or just to do it or let me cause some hoopla,\" McLaurin said. \"I tried to be as intentional as possible. Am I perfect? No, I'm not. Are there some things that you think about that you maybe want to handle different or do better? Sure, that's any situation.\" But it also was clear he wanted to stay in Washington, calling it a place he loved. \"When you have two sides that want to get the deal done that are open to compromise on both ends, that's when deals get done,\" McLaurin said. McLaurin said he met multiple times with general manager Adam Peters after reporting on July 27. \"We had a lot of cool conversations,\" Peters said. But there was still a roller coaster of emotions, he said. \"You get optimistic, pessimistic, all those different things throughout the process,\" Peters explained. \"But what we never lost was our love and respect and really admiration for Terry and what he does for us on and off the field. You've got to do what's best for the team but also reward someone for being a good player ... and don't lose perspective of what this person means to our locker room, to our team.\" After the agreement was announced Monday, Peters said he heard a commotion coming from outside his office. It was from players celebrating with McLaurin, who said he was mobbed by about 30 teammates coming into the weight room to congratulate him. \"Throughout this entire process, that was the biggest gift that I probably got playing football,\" McLaurin said. \"That's what the brotherhood is about. I hope that's a reflection of the type of team player they feel I am.\" There was little doubt the Commanders were happy to have him back. \"It's good to have his energy [back],\" linebacker Bobby Wagner said. \"He's so dynamic and such a great player,\" center Tyler Biadasz added. \"And as a leader of the group, it's huge.\"",
    "cleaned_date_timestamptz": null,
    "content_type": "news_article",
    "type_confidence": 0.95,
    "type_reasoning": "The excerpt is a single, coherent NFL news story focused on Washington Commanders WR Terry McLaurin returning to practice after signing a three-year contract extension — a specific news item."
  },
  "297076": {
    "title": "49ers won't trade WR Jauan Jennings, GM John Lynch says",
    "publication_date": "Aug 27, 2025, 06:24 PM ET",
    "author": "Nick Wagoner",
    "main_content": "SANTA CLARA, Calif. -- While the San Francisco 49ers remain unsure whether wide receiver Jauan Jennings will play in Week 1, general manager John Lynch was certain of one thing on Wednesday: The team has no desire to trade Jennings.\nSince Jennings departed practice on the fourth day of training camp with a calf injury, his status for this season and as a Niner has remained a question mark. Speaking to media on Wednesday, Lynch and coach Kyle Shanahan provided at least some clarity on what's been going on with Jennings and not just as it pertains to his injury.\nAccording to Lynch, Jennings requested a trade \"a while ago,\" though the Niners did not grant that request and have no intention of doing so. \"He asked for it and we've moved on,\" Lynch said. \"We're not doing that. So, we're moving forward.\"\nJennings is entering the final season of the two-year contract extension he signed in 2024. He is scheduled to count $4.258 million against this year's salary cap with more than $8 million in dead money remaining from lingering void years.\nESPN's Adam Schefter reported in mid-July that Jennings would like a lucrative contract extension or, barring that, a trade. Jennings reported to camp on time and participated in the first four practices of camp before leaving that fourth practice with a calf injury.\nLynch said Wednesday that \"both things can be true,\" meaning that Jennings does have a calf injury and wants a lucrative contract extension. Jennings hasn't practiced since July 27, and with the regular-season opener rapidly approaching, Lynch and Shanahan would like to get Jennings back on the field soon if he's going to have any chance to play in that game against the Seattle Seahawks on Sept. 7.\nTo this point, the 49ers have remained content to let Jennings play out the final year of his deal, though tweaks to the year he has remaining are still possible. San Francisco signed wideout Brandon Aiyuk to a $30 million-a-year extension last August and invested a first-round pick in Ricky Pearsall in 2024.\nThis isn't the first time the Niners have dealt with a trade request from a player by simply declining to grant it and letting it play out. They have done similar with kicker Robbie Gould, receiver Deebo Samuel and running back Raheem Mostert in recent years, though those all ended with a contract extension such as Samuel or added incentives for the current year like with Mostert.\nShanahan said Wednesday he doesn't view Jennings' desire for a new contract in a negative light for him or the team. \"I don't think that has anything to do with team chemistry,\" Shanahan said. \"That doesn't have anything to do with how we approach each other, how we spend our time with each other. That has to do with business decisions and the business decisions people make. I don't look at any of that stuff.\"\nStill, the 49ers have plenty of urgency to get Jennings healthy and back on the field given the state of their receiver room. After trimming the roster to the initial 53 on Tuesday, the team had just two healthy receivers - Pearsall and Skyy Moore -- among the five on the depth chart. San Francisco has multiple receiver-related moves in the works, signing veteran Marquez Valdes-Scantling to a one-year deal on Wednesday while planning to bring veteran Russell Gage Jr. back to the active roster on Thursday after releasing him on Tuesday. \"Jauan is still working through his calf issue, making progress,\" Lynch said. \"We're kind of like everyone else, hopeful but not sure on Week 1, and we'll proceed as such.\" The Niners also placed wideout Jacob Cowing (hamstring) on injured reserve and re-signed punter Thomas Morstead on Wednesday after claiming defensive tackle Jordan Jefferson on waivers from the Jacksonville Jaguars and waiving defensive tackle Evan Anderson to make room. Beyond that, Shanahan expressed optimism that the Niners will get some other key players back healthy in time for Seattle, a list that includes right guard Dominick Puni (knee), defensive tackle Yetur Gross-Matos (knee), left guard Ben Bartch (elbow) and slot cornerback Upton Stout (calf).",
    "cleaned_date_timestamptz": "2025-08-27T18:24:00",
    "content_type": "news_article",
    "type_confidence": 0.95,
    "type_reasoning": "The excerpt is a single coherent NFL news story focused on one specific item — the 49ers' decision not to trade WR Jauan Jennings — with details, quotes, and context about his status and contract."
  },
  "297077": {
    "title": "Chargers RB Najee Harris practices in pads for first time",
    "publication_date": "Aug 27, 2025, 09:08 PM ET",
    "author": "Kris Rhim",
    "main_content": "Chargers RB Najee Harris practices in pads for first time. EL SEGUNDO, Calif. -- Chargers running back Najee Harris practiced in pads Wednesday for the first time since signing a one-year deal in March. Harris looked explosive in individual drills during the portion of practice open to the media and caught multiple passes. He had a yellow jersey, which is worn at practice by players still working through an injury. Harris was injured in a Fourth of July fireworks mishap that landed him on the non-football Injury/illness list ahead of training camp. The Chargers activated Harris on Tuesday, making him eligible for the Week 1 game against the Kansas City Chiefs in Brazil. He has never missed a game in his NFL career. If he were to miss any time, the Chargers would have to lean heavily on rookie first-round pick Omarion Hampton. The Chargers haven't had a 1,000-yard rusher since Melvin Gordon III ran for 1,105 yards in 2017. Harris reached the milestone in each of his first four seasons with the Pittsburgh Steelers, and his physical style is coveted by coach Jim Harbaugh. Harbaugh and his staff boasted last season about the running game they would create in L.A., but the Chargers finished below the league average with just 110.7 rushing yards per game.",
    "cleaned_date_timestamptz": "2025-08-27T21:08:00",
    "content_type": "news_article",
    "type_confidence": 0.95,
    "type_reasoning": "Single coherent NFL story focused on one specific news item — Chargers RB Najee Harris practicing in pads and his status — fits a news article."
  },
  "297078": {
    "title": "Bengals give star DE Hendrickson big pay bump",
    "publication_date": "",
    "author": "2dBen Baby",
    "main_content": "\"This compromise comes with a great amount of respect for me towards them,\" he said in front of his locker on Wednesday. \"I'm incredibly honored and appreciative that I can play football at this level.\" \n\nBefore the two sides agreed to a new deal on Monday, Hendrickson was slated to potentially earn $16 million in cash for the 2024 season. Throughout the offseason, he was adamant that he had no intention of playing on that deal. And on the eve of training camp, the Bengals' front office indicated they wanted to give him a raise. \n\nThe two sides were at odds over the guaranteed money on the deal, including it stretching past the first season of any new contract. Aside from wide receiver Ja'Marr Chase, who netted a massive $161 million extension this offseason, Cincinnati historically has not given veterans guaranteed money aside from a signing bonus. \n\nHendrickson said the option that he agreed to wasn't previously offered in the negotiation. When it was, he said he was \"incredibly humbled by it.\" \n\nAnd it provided an avenue for the Bengals and him to work something out ahead of the season opener on Sept. 7 against the Cleveland Browns. \n\n\"I want to be a part of something special here,\" Hendrickson said. \"I've vocalized that pretty early and often. Again, I can't write my own contracts. I think we'd all as players love to do that. There wasn't one that I saw long term that I would've considered.\" \n\nHendrickson, 30, is coming off the best season of his career. He led the NFL with 17.5 sacks, earned his first Associated Press All-Pro selection and reached the Pro Bowl for the fourth straight season since signing with the Bengals during the 2021 free agency. \n\nThroughout his hold-in, which lasted the bulk of training camp, Hendrickson watched and observed drills. \n\n\"He's invested in the players around him,\" Bengals coach Zac Taylor said on Tuesday. \"He's got a lot of knowledge he wants to pass down.\" \n\nOn Wednesday, Hendrickson transitioned back into a playing role. When the team wrapped up its stretching period, he was the first person waiting to go through position drills with assistant coach Jerry Montgomery. \n\n\"Not that I didn't enjoy coaching, but that's not what I'm here to do,\" Hendrickson said. \"[I'm] looking forward to getting after quarterbacks.\"",
    "cleaned_date_timestamptz": null,
    "content_type": "news_article",
    "type_confidence": 0.96,
    "type_reasoning": "The excerpt is a single coherent NFL news story focused on Bengals defensive end Trey Hendrickson’s contract/guarantee negotiations and pay bump — one specific news item."
  },
  "297104": {
    "title": "# Jaguars' Travis Hunter and wife, Leanna, announce birth of son",
    "publication_date": "Aug 27, 2025, 10:01 PM ET",
    "author": "6hKalan Hooks",
    "main_content": "# Jaguars' Travis Hunter and wife, Leanna, announce birth of son\nplay\nRC adamant Jags play Travis Hunter on both sides (1:13)\nRyan Clark says if the Jaguars don't play Travis Hunter on both sides of the ball, it was a mistake to draft him. (1:13)\n * \nKalan HooksAug 27, 2025, 10:01 PM ET \n * [\n * Email\n * Print \nOpen Extended Reactions\nOn Wednesday evening, Jacksonville Jaguars rookie Travis Hunter and his wife, Leanna De La Fuente, revealed the arrival of their newborn son with a vlog on YouTube. The video titled \"Dear Son...\" documents the couple's timeline up to when their baby was born.\nIt starts with Hunter and De La Fuente displaying a pregnancy test's positive result, followed by ultrasound photos.\nDe La Fuente reveals in a March 26 video that she had a dream the previous month about having a baby boy. Indeed, on Feb. 28, she wrote a note in her phone titled \"Dream 2/28\" that reads, \"Baby was a boy with lots and lots of curly hair.\"\n\"I knew it was going to be a boy,\" De La Fuente says.\nThe couple didn't reveal their newborn's name nor a date of birth.\nDe La Fuente, 23, and Hunter, 22, also show short videos ahead of the 2025 NFL draft to document his draft process.\n\"We're going to find out where daddy's going to be ... and where you're going to grow up ... and where you're going to be born,\" the couple says in alternating phrases.\n## Editor's Picks\n * [](https://www.espn.com/nfl/story/_/id/46091058/ )\n## Jaguars' Travis Hunter tied the knot on Saturday to cap off momentous month\n94dMichael DiRocco \nAfter Hunter was selected as the No. 2 pick by the Jaguars, De La Fuente took a video of the two-way star and states, \"Your dad got drafted.\"\n\"And then you gonna come up and you gonna be like me and get drafted to Jacksonville,\" Hunter says later.\nHunter then continues the message to his son: \"Got to be better than me.\"\n## The enhanced ESPN App\n[](https://www.espn.com/nfl/story/_/id/46091058/ )\nWatch your favorite events in the newly upgraded ESPN App. Learn more about what plan is right for you. **Sign Up Now**\nThe video then shows highlights from De La Fuente's pregnancy, including her baby bump and the couple at the hospital prior to the birth of their son. It ends with audio of the baby crying as Hunter reassures his wife.\n\"Dear Son, We love you. Love, Mom and Dad,\" the video description reads.\nHunter and De La Fuente met at Collins High School in Suwanee, Georgia, and dated during Hunter's time at Jackson State and Colorado, before getting engaged in February.",
    "cleaned_date_timestamptz": "2025-08-27T22:01:00",
    "content_type": "news_article",
    "type_confidence": 0.95,
    "type_reasoning": "Single coherent story focused on one specific NFL-related news item—the Jacksonville Jaguars' Travis Hunter and his wife's announcement of their newborn son."
  }
}